PinguinoIDE/pinguino-compilers/windows32/p8/share/gputils/header/p16lf707.inc
;----- T1GCON Bits -----------------------------------------------------
T1GVAL           EQU  H'0002'
T1GGO_NOT_DONE   EQU  H'0003'
T1GSPM           EQU  H'0004'
T1GTM            EQU  H'0005'
T1GPOL           EQU  H'0006'
TMR1GE           EQU  H'0007'

T1GSS0           EQU  H'0000'
T1GSS1           EQU  H'0001'


;----- OSCCON Bits -----------------------------------------------------
ICSS             EQU  H'0002'
ICSL             EQU  H'0003'

IRCF0            EQU  H'0004'
IRCF1            EQU  H'0005'


;----- SSPSTAT Bits -----------------------------------------------------
BF               EQU  H'0000'
UA               EQU  H'0001'
R_NOT_W          EQU  H'0002'
S                EQU  H'0003'
P                EQU  H'0004'
D_NOT_A          EQU  H'0005'
CKE              EQU  H'0006'
SMP              EQU  H'0007'


;----- WPUB Bits -----------------------------------------------------
WPUB0            EQU  H'0000'
WPUB1            EQU  H'0001'
WPUB2            EQU  H'0002'
WPUB3            EQU  H'0003'
WPUB4            EQU  H'0004'
WPUB5            EQU  H'0005'
WPUB6            EQU  H'0006'
WPUB7            EQU  H'0007'


;----- IOCB Bits -----------------------------------------------------
IOCB0            EQU  H'0000'
IOCB1            EQU  H'0001'
IOCB2            EQU  H'0002'
IOCB3            EQU  H'0003'
IOCB4            EQU  H'0004'
IOCB5            EQU  H'0005'
IOCB6            EQU  H'0006'
IOCB7            EQU  H'0007'


;----- T3CON Bits -----------------------------------------------------
TMR3ON           EQU  H'0000'
T3SYNC           EQU  H'0002'

T3CKPS0          EQU  H'0004'
T3CKPS1          EQU  H'0005'
TMR3CS0          EQU  H'0006'
TMR3CS1          EQU  H'0007'


;----- TXSTA Bits -----------------------------------------------------
TX9D             EQU  H'0000'
TRMT             EQU  H'0001'
BRGH             EQU  H'0002'
SYNC             EQU  H'0004'
TXEN             EQU  H'0005'
TX9              EQU  H'0006'
CSRC             EQU  H'0007'


;----- APFCON Bits -----------------------------------------------------
CCP2SEL          EQU  H'0000'
SSSEL            EQU  H'0001'


;----- FVRCON Bits -----------------------------------------------------
FVREN            EQU  H'0006'
FVRRDY           EQU  H'0007'

ADFVR0           EQU  H'0000'
ADFVR1           EQU  H'0001'
CDAFVR0          EQU  H'0002'
CDAFVR1          EQU  H'0003'


;----- T3GCON Bits -----------------------------------------------------
T3GVAL           EQU  H'0002'
T3GGO_NOT_DONE   EQU  H'0003'
T3GSPM           EQU  H'0004'
T3GTM            EQU  H'0005'
T3GPOL           EQU  H'0006'
TMR3GE           EQU  H'0007'

T3GSS0           EQU  H'0000'
T3GSS1           EQU  H'0001'


;----- ADCON1 Bits -----------------------------------------------------
ADREF0           EQU  H'0000'
ADREF1           EQU  H'0001'
ADCS0            EQU  H'0004'
ADCS1            EQU  H'0005'
ADCS2            EQU  H'0006'


;----- TACON Bits -----------------------------------------------------
TAPSA            EQU  H'0003'
TASE             EQU  H'0004'
TACS             EQU  H'0005'
TMRAON           EQU  H'0007'

TAPS0            EQU  H'0000'
TAPS1            EQU  H'0001'
TAPS2            EQU  H'0002'

TMRAPSA          EQU  H'0003'
TMRASE           EQU  H'0004'
TMRACS           EQU  H'0005'

TMRAPS0          EQU  H'0000'
TMRAPS1          EQU  H'0001'
TMRAPS2          EQU  H'0002'


;----- CPSBCON0 Bits -----------------------------------------------------
TBXCS            EQU  H'0000'
CPSBOUT          EQU  H'0001'
CPSBRM           EQU  H'0006'
CPSBON           EQU  H'0007'

CPSBRNG0         EQU  H'0002'
CPSBRNG1         EQU  H'0003'


;----- CPSBCON1 Bits -----------------------------------------------------
CPSBCH0          EQU  H'0000'
CPSBCH1          EQU  H'0001'
CPSBCH2          EQU  H'0002'
CPSBCH3          EQU  H'0003'


;----- CPSACON0 Bits -----------------------------------------------------
TAXCS            EQU  H'0000'
CPSAOUT          EQU  H'0001'
CPSARM           EQU  H'0006'
CPSAON           EQU  H'0007'

CPSARNG0         EQU  H'0002'
CPSARNG1         EQU  H'0003'


;----- CPSACON1 Bits -----------------------------------------------------
CPSACH0          EQU  H'0000'
CPSACH1          EQU  H'0001'
CPSACH2          EQU  H'0002'
CPSACH3          EQU  H'0003'


;----- TBCON Bits -----------------------------------------------------
TBPSA            EQU  H'0003'
TBSE             EQU  H'0004'
TBCS             EQU  H'0005'
TMRBON           EQU  H'0007'

TBPS0            EQU  H'0000'
TBPS1            EQU  H'0001'
TBPS2            EQU  H'0002'

TMRBPSA          EQU  H'0003'
TMRBSE           EQU  H'0004'
TMRBCS           EQU  H'0005'

TMRBPS0          EQU  H'0000'
TMRBPS1          EQU  H'0001'
TMRBPS2          EQU  H'0002'


;----- DACCON0 Bits -----------------------------------------------------
DACOE            EQU  H'0005'
DACLPS           EQU  H'0006'
DACEN            EQU  H'0007'

DACPSS0          EQU  H'0002'
DACPSS1          EQU  H'0003'


;----- DACCON1 Bits -----------------------------------------------------
DACR0            EQU  H'0000'
DACR1            EQU  H'0001'
DACR2            EQU  H'0002'
DACR3            EQU  H'0003'
DACR4            EQU  H'0004'


;----- ANSELA Bits -----------------------------------------------------
ANSA0            EQU  H'0000'
ANSA1            EQU  H'0001'
ANSA2            EQU  H'0002'
ANSA3            EQU  H'0003'
ANSA4            EQU  H'0004'
ANSA5            EQU  H'0005'
ANSA6            EQU  H'0006'
ANSA7            EQU  H'0007'



;----- ANSELB Bits -----------------------------------------------------
ANSB0            EQU  H'0000'
ANSB1            EQU  H'0001'
ANSB2            EQU  H'0002'
ANSB3            EQU  H'0003'
ANSB4            EQU  H'0004'
ANSB5            EQU  H'0005'
ANSB6            EQU  H'0006'
ANSB7            EQU  H'0007'



;----- ANSELC Bits -----------------------------------------------------
ANSC0            EQU  H'0000'
ANSC1            EQU  H'0001'
ANSC2            EQU  H'0002'
ANSC5            EQU  H'0005'
ANSC6            EQU  H'0006'
ANSC7            EQU  H'0007'



;----- ANSELD Bits -----------------------------------------------------
ANSD0            EQU  H'0000'
ANSD1            EQU  H'0001'
ANSD2            EQU  H'0002'
ANSD3            EQU  H'0003'
ANSD4            EQU  H'0004'
ANSD5            EQU  H'0005'
ANSD6            EQU  H'0006'
ANSD7            EQU  H'0007'



;----- ANSELE Bits -----------------------------------------------------
ANSE0            EQU  H'0000'
ANSE1            EQU  H'0001'
ANSE2            EQU  H'0002'



;----- PMCON1 Bits -----------------------------------------------------
RD               EQU  H'0000'




